In [1]:
import pandas as pd
import numpy as np

In [28]:
raw_data = {'regiment': ['RICM', 'RICM', 'RICM', '2 REP', '2 REP', '3 RIMA', '3 RIMA', '3 RIMA', '13 DBLE', '13 DBLE', '13 DBLE', '2 RIMA'], 
        'compagnie': ['1°', '1°', '2°', '2°', '1°', '1°', '2°', '2°','1°', '1°', '2°', '2°'], 
        'nom': ['Jean', 'Donovan', 'Ali', 'Fleur', 'René', 'John', 'Rambo', 'Steeve', 'Harry', 'Pierre', 'Riani', 'Philippe'], 
        'preScoreFamas': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postScoreFamas': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'compagnie', 'nom', 'preScoreFamas', 'postScoreFamas'])
df

   regiment compagnie       nom  preScoreFamas  postScoreFamas
0      RICM        1°      Jean              4              25
1      RICM        1°   Donovan             24              94
2      RICM        2°       Ali             31              57
3     2 REP        2°     Fleur              2              62
4     2 REP        1°      René              3              70
5    3 RIMA        1°      John              4              25
6    3 RIMA        2°     Rambo             24              94
7    3 RIMA        2°    Steeve             31              57
8   13 DBLE        1°     Harry              2              62
9   13 DBLE        1°    Pierre              3              70
10  13 DBLE        2°     Riani              2              62
11   2 RIMA        2°  Philippe              3              70

In [29]:
categos = df.groupby("regiment")

In [30]:
categos.max()

         compagnie       nom  preScoreFamas  postScoreFamas
regiment
13 DBLE         2°     Riani              3              70
2 REP           2°      René              3              70
2 RIMA          2°  Philippe              3              70
3 RIMA          2°    Steeve             31              94
RICM            2°      Jean             31              94

In [31]:
categos.min()

         compagnie       nom  preScoreFamas  postScoreFamas
regiment
13 DBLE         1°     Harry              2              62
2 REP           1°     Fleur              2              62
2 RIMA          2°  Philippe              3              70
3 RIMA          1°      John              4              25
RICM            1°       Ali              4              25

In [32]:
categos.sum()

          preScoreFamas  postScoreFamas
regiment
13 DBLE               7             194
2 REP                 5             132
2 RIMA                3              70
3 RIMA               59             176
RICM                 59             176

In [33]:
categos.get_group("RICM")["postScoreFamas"].sum()

176

In [34]:
categos.mean()

          preScoreFamas  postScoreFamas
regiment
13 DBLE        2.333333       64.666667
2 REP          2.500000       66.000000
2 RIMA         3.000000       70.000000
3 RIMA        19.666667       58.666667
RICM          19.666667       58.666667

In [35]:
categos["postScoreFamas"].sum()

regiment
13 DBLE    194
2 REP      132
2 RIMA      70
3 RIMA     176
RICM       176
Name: postScoreFamas, dtype: int64

In [38]:
categos["postScoreFamas"].min()

regiment
13 DBLE    62
2 REP      62
2 RIMA     70
3 RIMA     25
RICM       25
Name: postScoreFamas, dtype: int64

In [36]:
categos["postScoreFamas"].max()

regiment
13 DBLE    70
2 REP      70
2 RIMA     70
3 RIMA     94
RICM       94
Name: postScoreFamas, dtype: int64

In [37]:
categos[["preScoreFamas", "postScoreFamas"]].sum()

          preScoreFamas  postScoreFamas
regiment
13 DBLE               7             194
2 REP                 5             132
2 RIMA                3              70
3 RIMA               59             176
RICM                 59             176